soiv-dmp-test/src/main/resources/com/ericsson/soiv/teststeps/protocols/bscs/ReadContract.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:con="http://ericsson.com/services/ws_CIL_6/contractread" xmlns:ses="http://ericsson.com/services/ws_CIL_6/sessionchange">
    <soapenv:Header>
        <Security xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
            <UsernameToken>
                <Username>ADMX</Username>
                <Password>ADMX</Password>
            </UsernameToken>
        </Security>
    </soapenv:Header>
    <soapenv:Body>
        <con:contractReadRequest>
            <con:inputAttributes>
                <con:coIdPub>{{contractID}}</con:coIdPub>
            </con:inputAttributes>
            <con:sessionChangeRequest>
                <ses:values>
                    <ses:item>
                        <ses:key>BU_ID</ses:key>
                        <ses:value>2</ses:value>
                    </ses:item>
                </ses:values>
            </con:sessionChangeRequest>
        </con:contractReadRequest>
    </soapenv:Body>
</soapenv:Envelope>

